Revit 2026 API

# ViewNode Properties

---

The ViewNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RenderNode) |
|  | LevelOfDetail | The level of detail the view is going to be rendered at. |
|  | NodeName | A readable name of the output node. (Inherited from RenderNode) |
|  | ViewId | The Id of the view element. |

#### Reference

ViewNode Class

Autodesk.Revit.DB Namespace